Revit 2027 API
LightGroup.AddLight Method
 Add a new light instance to the group
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddLight(
	ElementId lightId
)
Public Sub AddLight (
	lightId As ElementId
)
public:
void AddLight(
	ElementId^ lightId
)
member AddLight :
        lightId : ElementId -> unit
Parameters
lightId ElementId
 The ID of the light instance to add to the group
Exceptions
Exception | Condition
ArgumentException |  The given element ID does not correspond to a light instance -or- The light instance is in this LightGroup
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace